package com.el.cmic.stock;

import org.junit.Before;
import org.junit.Test;
import org.springframework.context.support.ClassPathXmlApplicationContext;

import com.el.cmic.service.stock.StockService;

public class TestStock {
	
	private ClassPathXmlApplicationContext  context;
	private String data;
	
	@Before
	public void testBefore(){
		context = new ClassPathXmlApplicationContext("config/spring/applicationContext.xml");
		data="{"
				+"\"明细\":["
								+"{"
								+"\"物流中心\":8,"
								+"\"货主\":\"01001\","
								+"\"通知单号\":\"2\","
								+"\"验收单号\":\"2\","
								+"\"客户编号\":\"2\","
								+"\"客户名称\":\"2\","
								+"\"货品编号\":\"0100132\","
								+"\"货品名称\":\"阿莫西林胶囊\","
								+"\"批号\":\"2016070148939\","
								+"\"灭菌批号\":\"33\","
								+"\"有效期至\":\"2019-09-08\","
								+"\"生产日期\":\"2019-09-08\","
								+"\"到货数量\":50,"
								+"\"验收合格数量\":50,"
								+"\"拒收数量\":0,"
								+"\"单位\":\"2\","
								+"\"质量状况\":\"3\","
								+"\"验收结论\":\"3\","
								+"\"验收员\":\"2\","
								+"\"验收员2\":\"2\","
								+"\"验收日期\":\"2019-09-08\","
								+"\"到货日期\":\"2019-09-08\","
								+"\"检验报告书\":\"2\","
								+"\"不合格事项及处理措施\":\"3\","
								+"\"通用名\":\"3\","
								+"\"剂型\":\"3\","
								+"\"规格\":\"2\","
								+"\"产地\":\"3\","
								+"\"注册证号\":\"\","
								+"\"批准文号\":\"\","
								//+"\"生产企业许可证号或者备案凭证号\":\"\","
								+"\"生产厂商\":\"\","
								+"\"验收类别\":\"2\","
								+"\"储存条件\":\"3\""
								+"},"
								+"{"
								+"\"物流中心\":4,"
								+"\"货主\":\"01001\","
								+"\"通知单号\":\"2\","
								+"\"验收单号\":\"2\","
								+"\"客户编号\":\"2\","
								+"\"客户名称\":\"2\","
								+"\"货品编号\":\"0100132\","
								+"\"货品名称\":\"阿莫西林胶囊\","
								+"\"批号\":\"2016070148939\","
								+"\"灭菌批号\":\"33\","
								+"\"有效期至\":\"2019-09-08\","
								+"\"生产日期\":\"2019-09-08\","
								+"\"到货数量\":50,"
								+"\"验收合格数量\":50,"
								+"\"拒收数量\":0,"
								+"\"单位\":\"2\","
								+"\"质量状况\":\"3\","
								+"\"验收结论\":\"3\","
								+"\"验收员\":\"2\","
								+"\"验收员2\":\"2\","
								+"\"验收日期\":\"2019-09-08\","
								+"\"到货日期\":\"2019-09-08\","
								+"\"检验报告书\":\"2\","
								+"\"不合格事项及处理措施\":\"3\","
								+"\"通用名\":\"3\","
								+"\"剂型\":\"3\","
								+"\"规格\":\"2\","
								+"\"产地\":\"3\","
								+"\"注册证号\":\"\","
								+"\"批准文号\":\"\","
								//+"\"生产企业许可证号或者备案凭证号\":\"\","
								+"\"生产厂商\":\"\","
								+"\"验收类别\":\"2\","
								+"\"储存条件\":\"3\""
								+"}"
				+"]"
				+"}";
}
	
	@Test
	public void myTest(){
		StockService stockService = (StockService)context.getBean("stockServiceImpl");
		stockService.callInsertConserveDatail(data);
	}

}
